error.repo.user-not-found                                   = Ng\u01B0\u1EDDi d\u1EE5ng kh\u00F4ng t\u1ED3n t\u1EA1i trong kho l\u01B0u tr\u1EEF c\u1EE7c b\u1ED1.
error.exceeded-refresh-token                                = S\u1ED1 l\u1EA7n l\u00E0m m\u1EDBi token \u0111\u00E3 v\u1EDBt qua gi\u1EDbi h\u1EA1n. Vui l\u00F2ng \u0111\u0103ng nh\u1EADp l\u1EA1i.
error.login-session-not-found                               = Kh\u00F4ng t\u1EAft th\u1EA5y phi\u1EBFu \u0111\u0103ng nh\u1EADp cho token l\u00E0m m\u1EDBi. Vui l\u00F2ng \u0111\u0103ng nh\u1EADp l\u1EA1i.
error.refreshing-unknown-token                              = L\u1ED7i khi l\u00E0m m\u1EDBi token kh\u00F4ng x\u00E1c \u0111\u1ECBnh.
error.invalid-credentials                                   = Th\u00F4ng tin \u0111\u0103ng nh\u1EADp kh\u00F4ng h\u1EE3p l\u1EA1.
error.unknown-login                                         = L\u1ED7i \u0111\u0103ng nh\u1EADp kh\u00F4ng x\u00E1c \u0111\u1ECBnh.
error.invalid-refresh-token                                 = Token l\u00E0m m\u1EDBi kh\u00F4ng h\u1EE3p l\u1EA1.
error.access-token-invalid                                  = Token truy c\u1EADp kh\u00F4ng c\u00F2n h\u1EE3p l\u1EA1 (phi\u1EBFu \u0111\u0103ng nh\u1EADp \u0111\u00E3 \u0111\u0103ng xu\u1EA5t).
error.token-expired                                         = Token \u0111\u00E3 h\u1EBFt h\u1EA1n.
error.retrieve-token                                        = L\u1EA5y token th\u1EAF t b\u1EA5i.
error.invalid-expired-refresh-token                         = Token l\u00E0m m\u1EDBi kh\u00F4ng h\u1EE3p l\u1EA1 ho\u1EB7c \u0111\u00E3 h\u1EBFt h\u1EA1n.
error.parse-introspect-result                               = L\u1ED7i khi ph\u00E2n t\u00EDch k\u1EBFt qu\u1EA3 ki\u1EC7m tra Keycloak.
error.get-access-token                                      = L\u1EA5y token truy c\u1EADp th\u1EAF t b\u1EA5i.
error.keycloak.user-not-found                               = Kh\u00F4ng t\u1EAft th\u1EA5y ng\u01B0\u1EDDi d\u1EE5ng trong Keycloak.
error.parse-info-user-result                                = L\u1ED7i khi ph\u00E2n t\u00EDch k\u1EBFt qu\u1EA3 th\u00F4ng tin ng\u01B0\u1EDDi d\u1EE5ng.
error.check-active-session                                  = L\u1ED7i khi ki\u1EC3m tra phi\u1EBFu ho\u1EA1t \u0111\u1ED9ng.
error.assigning-role                                        = Ng\u01B0\u1EDDi d\u1EE5ng \u0111\u01B0\u1ED3c t\u1EA1o nh\u01B0ng kh\u00F4ng th\u1EC3 g\u1EA3n vai tr\u00F2.
error.creating-user                                         = T\u1EA1o ng\u01B0\u1EDDi d\u1EE5ng th\u1EAF t b\u1EA5i.
error.getting-role                                          = L\u1EA5y vai tr\u00F2 th\u1EAF t b\u1EA5i.
error.assigning-role-exception                              = Ngo\u00E0i l\u1ECD khi g\u1EA3n vai tr\u00F2 cho ng\u01B0\u1EDDi d\u1EE5ng.
error.old-password-incorrect                                = M\u1EADt kh\u1EA9u c\u1EE7 kh\u00F4ng ch\u00EDnh x\u00E1c.
error.new-password-same-old-password                        = M\u1EADt kh\u1EA9u m\u1EDBi gi\u1EDBi v\u1EDBi m\u1EADt kh\u1EA9u c\u1EE7.
error.change-password                                       = \u0110\u1ED5i m\u1EADt kh\u1EA9u th\u1EAF t b\u1EA5i.
error.delete-user                                           = X\u00F3a ng\u01B0\u1EDDi d\u1EE5ng th\u1EAF t b\u1EA5i.
